; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v2 - type_2 ?v7 - type_1)
 	      (pred_3 ?v1 - object ?v7 - type_1)
	      (pred_4 ?v2 - type_2 ?v3 - type_3)
	      (pred_1 ?v2 - type_2 ?v1 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v2 - type_2 ?v5 ?v8 - type_1)
       :precondition (and  (pred_2 ?v2 ?v5))
       :effect (and  (pred_2 ?v2 ?v8)
		     (not (pred_2 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_2 ?v4 - object ?v6 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v6) (pred_2 ?v2 ?v6) (pred_4 ?v2 ?v3))
       :effect (and (pred_1 ?v2 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v6)) 
		    (not (pred_4 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_2 ?v4 - object ?v6 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v4 ?v3) (pred_2 ?v2 ?v6))
       :effect (and (pred_3 ?v4 ?v6)
		    (pred_4 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v4 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_04 - type_2
obj_12 obj_03 obj_09 obj_11 - type_3
obj_14 obj_02 obj_08 obj_07 - type_1
obj_10 obj_01 obj_13 obj_06 - object)
(:init
(pred_2 obj_05 obj_08)
(pred_4 obj_05 obj_12)
(pred_4 obj_05 obj_03)
(pred_2 obj_04 obj_07)
(pred_4 obj_04 obj_09)
(pred_4 obj_04 obj_11)
(pred_3 obj_10 obj_08)
(pred_3 obj_01 obj_14)
(pred_3 obj_13 obj_02)
(pred_3 obj_06 obj_08)
)
(:goal
(and
(pred_3 obj_10 obj_07)
(pred_3 obj_01 obj_02)
(pred_3 obj_13 obj_02)
(pred_3 obj_06 obj_14)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_05 obj_14) (pred_2 obj_04 obj_14))))
  )
)
)

; plan
1. (op_2 obj_05 obj_10 obj_08 obj_03)
   deleted: (pred_3 obj_10 obj_08) (pred_4 obj_05 obj_03)
   added: (pred_1 obj_05 obj_10 obj_03)
   goals met: 1 of 4
2. (op_2 obj_05 obj_06 obj_08 obj_12)
   deleted: (pred_3 obj_06 obj_08) (pred_4 obj_05 obj_12)
   added: (pred_1 obj_05 obj_06 obj_12)
   goals met: 1 of 4
3. (op_1 obj_04 obj_07 obj_02)
   deleted: (pred_2 obj_04 obj_07)
   added: (pred_2 obj_04 obj_02)
   goals met: 1 of 4
4. (op_1 obj_05 obj_08 obj_07)
   deleted: (pred_2 obj_05 obj_08)
   added: (pred_2 obj_05 obj_07)
   goals met: 1 of 4
5. (op_3 obj_05 obj_10 obj_07 obj_03)
   deleted: (pred_1 obj_05 obj_10 obj_03)
   added: (pred_3 obj_10 obj_07) (pred_4 obj_05 obj_03)
   goals met: 2 of 4
6. (op_1 obj_05 obj_07 obj_14)
   deleted: (pred_2 obj_05 obj_07)
   added: (pred_2 obj_05 obj_14)
   goals met: 2 of 4
7. (op_3 obj_05 obj_06 obj_14 obj_12)
   deleted: (pred_1 obj_05 obj_06 obj_12)
   added: (pred_3 obj_06 obj_14) (pred_4 obj_05 obj_12)
   goals met: 3 of 4
8. (op_2 obj_05 obj_01 obj_14 obj_03)
   deleted: (pred_3 obj_01 obj_14) (pred_4 obj_05 obj_03)
   added: (pred_1 obj_05 obj_01 obj_03)
   goals met: 3 of 4
9. (op_1 obj_05 obj_14 obj_02)
   deleted: (pred_2 obj_05 obj_14)
   added: (pred_2 obj_05 obj_02)
   goals met: 3 of 4
10. (op_3 obj_05 obj_01 obj_02 obj_03)
   deleted: (pred_1 obj_05 obj_01 obj_03)
   added: (pred_3 obj_01 obj_02) (pred_4 obj_05 obj_03)
   goals met: 4 of 4
